package consts

const (
	COUNT_USER = 20

	USERNAME          = "user_%v"   // index
	AUTHOR_NAME       = "author_%v" // index
	EMAIL_DOMAIN_NAME = "%v@vk.com" // username
	PASSWORD          = "PassW0rd!"

	PAGE_INFO = "Страница самого крутого автора - %v" // username

	CUSTOM_NAME     = "Крутая подписка %v автора %v"  // index
	CUSTOM_COST     = 10                              // cost * index
	CUSTOM_SUB_INFO = "Пописывайтесь - не пожалеете!" //

	TITLE = "Пост о смысле %v %v от %v"
	ABOUT = `Я в своем познании настолько преисполнился, что я как будто бы уже сто триллионов миллиардов лет проживаю на триллионах и триллионах таких же планет, как эта Земля, мне этот мир абсолютно понятен, и я здесь ищу только одного - покоя, умиротворения и вот этой гармонии, от слияния с бесконечно вечным, от созерцания великого фрактального подобия и от вот этого замечательного всеединства существа, бесконечно вечного, куда ни посмотри, хоть вглубь - бесконечно малое, хоть ввысь - бесконечное большое, понимаешь? А ты мне опять со своим вот этим, иди суетись дальше, это твоё распределение, это твой путь и твой горизонт познания и ощущения твоей природы, он несоизмеримо мелок по сравнению с моим, понимаешь? Я как будто бы уже давно глубокий старец, бессмертный, ну или там уже почти бессмертный, который на этой планете от её самого зарождения, ещё когда только Солнце только-только сформировалось как звезда, и вот это газопылевое облако, вот, после взрыва, Солнца, когда оно вспыхнуло, как звезда, начало формировать вот эти коацерваты, планеты, понимаешь, я на этой Земле уже как будто почти пять миллиардов лет живу и знаю её вдоль и поперёк этот весь мир, а ты мне какие-то... мне не важно на твои тачки, на твои яхты, на твои квартиры, там, на твоё благо. Я был на этой планете бесконечным множеством, и круче Цезаря, и круче Гитлера, и круче всех великих, понимаешь, был, а где-то был конченым говном, ещё хуже, чем здесь. Я множество этих состояний чувствую. @%v
`
)
