package consts

const (
	QuestionTypeCount    = 3
	QuestionForTypeCount = 5
)

const (
	Question     = "Оцени наш сервис PushArt"
	QuestionType = "Средние оценки наших пользователей"

	QuestionType0 = "Средние оценки наших пользователей"

	Question_0_1  = "Оцени наш сервис PushArt"
	Question_0_2  = "Насколько легко вам было зарегистрироваться на платформе PushArt?"
	Question_0_3  = "Как вы оцениваете интерфейс и удобство использования PushArt?"
	Question_0_4  = "Насколько полезными вы считаете инструменты монетизации, предлагаемые PushArt?"
	Question_0_5  = "Как вы оцениваете качество поддержки клиентов PushArt?"
	Question_0_6  = "Насколько удовлетворены вы уровнем дохода, который вы получаете через PushArt?"
	Question_0_7  = "Как вы узнали о сервисе PushArt?"
	Question_0_8  = "Что вам больше всего нравится в PushArt?"
	Question_0_9  = "Что бы вы хотели улучшить в сервисе PushArt?"
	Question_0_10 = "Как вы оцениваете скорость обработки запросов и выплат в PushArt?"
	Question_11   = "Насколько вероятно, что вы порекомендуете PushArt своим друзьям или коллегам?"
	//Question_12 = "Как вы оцениваете разнообразие форматов контента, доступных для монетизации в PushArt?"
	//Question_13 = "Сколько времени вы тратите на платформе PushArt каждый день?"
	//Question_14 = "Как вы оцениваете прозрачность условий сотрудничества с PushArt?"
	//Question_15 = "Есть ли у вас дополнительные комментарии или пожелания по улучшению сервиса PushArt?"

	QuestionType1 = "Рекомендации от наших пользователей"

	Question_1_1  = "Порекомендуете ли Вы PushArt своим друзьям?"
	Question_1_2  = "Насколько вероятно, что вы расскажете о PushArt в социальных сетях?"
	Question_1_3  = "Как вы оцениваете опыт работы с PushArt по сравнению с другими сервисами?"
	Question_1_4  = "Что именно вас побудило бы рекомендовать PushArt другим?"
	Question_1_5  = "Какой аспект PushArt вы бы выделили в своем отзыве для друзей?"
	Question_1_6  = "Если бы вы могли изменить что-то в PushArt, что это было бы, чтобы повысить вашу готовность рекомендовать сервис?"
	Question_1_7  = "Как вы узнали о PushArt, и кто вам его порекомендовал?"
	Question_1_8  = "Насколько вы удовлетворены результатами, которые получаете с помощью PushArt?"
	Question_1_9  = "Как вы оцениваете соотношение цены и качества услуг PushArt?"
	Question_1_10 = "Есть ли у вас примеры успешного использования PushArt, которые вы бы хотели поделиться с другими?"

	QuestionType2 = "Оценка контента от наших дорогих читателей"

	Question_2_1  = "Нравится ли вам, какой контент публикуется в PushArt?"
	Question_2_2  = "Какой тип контента вам наиболее интересен на платформе PushArt?"
	Question_2_3  = "Насколько разнообразным вы считаете контент, представленный в PushArt?"
	Question_2_4  = "Как вы оцениваете качество контента, публикуемого на PushArt?"
	Question_2_5  = "Что вам больше всего нравится в контенте, представленном на PushArt?"
	Question_2_6  = "Есть ли какой-то контент, который вы хотели бы видеть чаще на PushArt?"
	Question_2_7  = "Как вы оцениваете актуальность публикуемого контента на PushArt?"
	Question_2_8  = "Насколько контент на PushArt соответствует вашим интересам и предпочтениям?"
	Question_2_9  = "Как вы относитесь к новинкам и обновлениям контента на PushArt?"
	Question_2_10 = "Есть ли у вас предложения по улучшению контента на PushArt?"
)
